//
//  FlagDataStore.swift
//  Hangman Classic
//
//  Created by M I C H A E L on 25.04.2023.
//

final class FlagDataStore {
    
  static let shared = FlagDataStore()
    
    // MARK: - АЗИЯ
    let asia = [
        "Афганистан": "AF",
        "Бангладеш": "BD",
        "Бруней": "BN",
        "Бутан": "BT",
        "Тимор-Лесте (Восточный Тимор)": "TL",
        "Вьетнам": "VN",
        "Индия": "IN",
        "Индонезия": "ID",
        "Казахстан": "KZ",
        "Камбоджа": "KH",
        "Киргизия": "KG",
        "Китай": "CN",
        "Лаос": "LA",
        "Макао": "MO",
        "Малайзия": "MY",
        "Мальдивы": "MV",
        "Монголия": "MN",
        "Мьянма (Бирма)": "MM",
        "Непал": "NP",
        "Пакистан": "PK",
        "Папуа – Новая Гвинея": "PG",
        "Россия": "RU",
        "Сингапур": "SG",
        "Таджикистан": "TJ",
        "Таиланд": "TH",
        "Тайвань": "TW",
        "Туркменистан": "TM",
        "Узбекистан": "UZ",
        "Филиппины": "PH",
        "Шри-Ланка": "LK",
        "Южная Корея": "KR",
//        "Северная Корея": "Korea (North)",
        "Япония": "JP"
    ]
    
    // MARK: - АФРИКА
    let africa = [
        "Алжир": "DZ",
        "Ангола": "AO",
        "Бенин": "BJ",
        "Ботсвана": "BW",
        "Буркина-Фасо": "BF",
        "Бурунди": "BI",
        "Габон": "GA",
        "Гамбия": "GM",
        "Гана": "GH",
        "Гвинея": "GN",
        "Гвинея-Бисау": "GW",
        "Джибути": "DJ",
        "Египет": "EG",
//        "Эсватини": "Eswatini",
        "Замбия": "ZM",
        "Западная Сахара": "EH",
        "Зимбабве": "ZW",
//        "Кабо-Верде": "Cabo Verde Escudo",
        "Камерун": "CM",
        "Кения": "KE",
        "Коморы": "KM",
        "Кот-д’Ивуар": "CI",
        "Лесото": "LS",
        "Либерия": "LR",
        "Маврикий": "MU",
        "Мавритания": "MR",
        "Мадагаскар": "MG",
        "Майотта": "YT",
        "Малави": "MW",
        "Мали": "ML",
        "Марокко": "MA",
        "Мозамбик": "MZ",
        "Намибия": "NA",
        "Нигер": "NE",
        "Нигерия": "NG",
//        "Тристан-да-Кунья": "Tristan da Cunha",
        "Конго": "CG",
        "Конго (Демократическая Республика)": "CD",
        "Реюньон": "RE",
        "Руанда": "RW",
        "Сан-Томе и Принсипи": "ST",
        "Свазиленд": "SZ",
        "Сейшелы": "SC",
        "Сенегал": "SN",
        "Сомали": "SO",
        "Судан": "SD",
        "Сьерра-Леоне": "SL",
        "Танзания": "TZ",
        "Того": "TG",
        "Тунис": "TN",
        "Уганда": "UG",
        "ЦАР": "CF",
        "Чад": "TD",
        "Эквадор": "EC",
        "Экваториальная Гвинея": "GQ",
        "Эритрея": "ER",
        "Эфиопия": "ET",
        "Южная Африка": "ZA",
        "Южный Судан": "SS"
    ]
    
    // MARK: - БЛИЖНИЙ ВОСТОК
    let nearEast = [
        "Азербайджан": "AZ",
        "Армения": "AM",
        "Бахрейн": "BH",
        "Грузия": "GE",
        "Израиль": "IL",
        "Иордания": "JO",
        "Палестина": "PS",
        "Ирак": "IQ",
        "Иран": "IR",
        "Йемен": "YE",
        "Катар": "QA",
        "Кувейт": "KW",
        "Ливан": "LB",
        "Объединенные Арабские Эмираты": "AE",
        "Оман": "OM",
        "Саудовская Аравия": "SA",
        "Сирия": "SY",
        "Турция": "TR"
    ]
    
    // MARK: - ЕВРОПА
    let europe = [
//        "Евросоюз": "European Union",
//        "Косово": "Косово",
        "Австрия": "AT",
        "Албания": "AL",
        "Андорра": "AD",
        "Беларусь": "BY",
        "Бельгия": "BE",
        "Болгария": "BG",
        "Босния и Герцеговина": "BA",
        "Ватикан": "VA",
        "Великобритания": "GB",
        "Венгрия": "HU",
        "Германия": "DE",
        "Гибралтар": "GI",
        "Греция": "GR",
        "Дания": "DK",
        "Ирландия": "IE",
        "Исландия": "IS",
        "Испания": "ES",
        "Италия": "IT",
        "Кипр": "CY",
        "Ливия": "LY",
        "Литва": "LT",
        "Латвия": "LV",
        "Лихтенштейн": "LI",
        "Люксембург": "LU",
        "Македония": "MK",
        "Мальта": "MT",
        "Молдова": "MD",
        "Монако": "MC",
        "Нидерланды": "NL",
        "Норвегия": "NO",
        "Шпицберген и Ян-Майен": "SJ",
        "Остров Мэн": "IM",
        "Польша": "PL",
        "Португалия": "PT",
        "Румыния": "RO",
        "Сан-Марино": "SM",
        "Сербия": "RS",
        "Словакия": "SK",
        "Словения": "SI",
        "Украина": "UA",
        "Фарерские острова": "FO",
        "Финляндия": "FI",
        "Франция": "FR",
        "Хорватия": "HR",
        "Черногория": "ME",
        "Чехия": "CZ",
        "Швейцария": "CH",
        "Швеция": "SE",
        "Эстония": "EE"
    ]
    
    // MARK: - КАРИБСКИЙ БАССЕЙН
    let caribbean = [
        "Ангилья": "AI",
        "Антигуа и Барбуда": "AG",
        "Аруба": "AW",
        "Багамские Острова": "BS",
        "Барбадос": "BB",
        "Британские Виргинские острова": "VG",
        "Виргинские острова": "VI",
        "Гаити": "HT",
        "Гваделупа": "GP",
        "Гренада": "GD",
        "Доминика": "DM",
        "Доминиканская Республика": "DO",
        "Каймановы острова": "KY",
        "Куба": "CU",
        "Кюрасао": "CW",
        "Мартиника": "MQ",
        "Монтсеррат": "MS",
        "Пуэрто-Рико": "PR",
        "Сент-Винсент и Гренадины": "VC",
        "Сент-Китс и Невис": "KN",
//        "Сент-Люсия": "LC",
        "Синт-Мартен": "SX",
        "Тринидад и Тобаго": "TT",
        "Ямайка": "JM"
    ]
    
    // MARK: - ОКЕАНИЯ
    let oceania = [
        "Австралия": "AU",
        "Американское Самоа": "AS",
        "Вануату": "VU",
        "Гуам": "GU",
        "Кирибати": "KI",
        "Кокосовые острова": "CC",
        "Маршалловы Острова": "MH",
        "Микронезия": "FM",
        "Науру": "NR",
        "Ниуэ": "NU",
        "Новая Зеландия": "NZ",
        "Новая Каледония": "NC",
        "Остров Норфолк": "NF",
//        "Остров Рождества": "CX",
        "Острова Кука": "CK",
        "Палау": "PW",
        "Самоа": "WS",
        "Северные Марианские острова": "MP",
        "Токелау": "TK",
        "Тонга": "TO",
        "Тувалу": "TV",
        "Уоллис и Футуна": "WF",
        "Фиджи": "FJ",
        "Французская Полинезия": "PF",
        "Соломоновы острова": "SB"
    ]
    
    // MARK: - СЕВЕРНАЯ АМЕРИКА
    let northAmerica = [
        "Бермудские Острова": "BM",
        "Гренландия": "GL",
        "Канада": "CA",
        "Мексика": "MX",
        "Соединенные Штаты": "US"
    ]
    
    // MARK: - ЦЕНТРАЛЬНАЯ АМЕРИКА
    let centralAmerica = [
        "Белиз": "BZ",
        "Гватемала": "GT",
        "Гондурас": "HN",
        "Коста-Рика": "CR",
        "Никарагуа": "NI",
        "Панама": "PA",
        "Сальвадор": "SV"
    ]
    
    // MARK: - ЮЖНАЯ АМЕРИКА
    let southAmerica = [
        "Аргентина": "AR",
        "Боливия": "BO",
        "Бразилия": "BR",
        "Венесуэла": "VE",
        "Гайана": "GY",
        "Колумбия": "CO",
        "Парагвай": "PY",
        "Перу": "PE",
        "Суринам": "SR",
        "Уругвай": "UY",
        "Фолклендские острова": "FK",
        "Французская Гвиана": "GF",
        "Чили": "CL"
    ]
    
    private init() {}
}
