//
//  FlagDataStore.swift
//  Hangman Classic
//
//  Created by M I C H A E L on 25.04.2023.
//

final class FlagDataStore {
    
        let flagsAndCourties = [
            // MARK: - АЗИЯ
            "Афганистан": "Afghanistan",
            "Бангладеш": "Bangladesh",
            "Бруней": "Brunei",
            "Бутан": "Bhutan",
            "Восточный Тимор": "Timor-Leste", //--
            "Вьетнам": "Vietnam",
            "Индия": "India",
            "Индонезия": "Indonesia",
            "Казахстан": "Kazakhstan",
            "Камбоджа": "Cambodia",
            "Киргизия": "Kyrgyzstan",
            "Китай": "China",
            "Лаос": "Laos",
            "Макао": "Macau",
            "Малайзия": "Malaysia",
            "Мальдивы": "Maldives",
            "Монголия": "Mongolia",
            "Мьянма": "Myanmar (Burma)",
            "Непал": "Nepal",
            "Пакистан": "Pakistan",
            "Папуа - Новая Гвинея": "Papua New Guinea",
            "Россия": "Russia",
            "Северная Корея": "Korea (North)",
            "Сингапур": "Singapore",
            "Таджикистан": "Tajikistan",
            "Тайланд": "Thailand",
            "Тайвань": "Taiwan",
            "Туркменистан": "Turkmenistan",
            "Узбекистан": "Uzbekistan",
            "Филиппины": "Philippines",
            "Шри-Ланка": "Sri Lanka",
            "Южная Корея": "Korea (South)",
            "Япония": "Japan",
    
            // MARK: - АФРИКА
            "Алжир": "Algeria",
            "Ангола": "Angola",
            "Бенин": "Benin",     //--
            "Ботсвана": "Botswana",
            "Буркина-Фасо": "Burkina Faso",   //--
            "Бурунди": "Burundi",
            "Габон": "Gabon",   //--
            "Гамбия": "Gambia",
            "Гана": "Ghana",
            "Гвинея": "Guinea",
            "Гвинея-Бисау": "Guine-Bissau",   //--
            "Дем. Респ. Конго": "Dem. Rep. Congo",
            "Джибути": "Djibouti",
            "Египет": "Egypt",
            "Эсватини": "Eswatini",
            "Замбия": "Zambia",
            "Западная Сахара": "West Sahara",   //--
            "Зимбабве": "Zimbabwe",   //--
            "Кабо-Верде": "Cabo Verde Escudo",
            "Камерун": "Cameroon",   //--
            "Кения": "Kenya",
            "Коморы": "Comoros",
            "Кот-д'Ивуар": "Ivory Coast",   //--
            "Лесото": "Lesotho",
            "Либерия": "Liberia",
            "Ливия": "Libya",
            "Маврикий": "Mauritius",
            "Мавритания": "Mauritania",
            "Мадагаскар": "Madagascar",
            "Майотта": "Mayotte",   //--
            "Малави": "Malawi",
    
    
    
            "Мали": "Mali",   //------------------
            "Марокко": "Morocco",
            "Мозамбик": "Mozambique",
            "Намибия": "Namibia",
            "Нигер": "Niger",   //------------------
            "Нигерия": "Nigeria",
            "Тристан-да-Кунья": "Tristan da Cunha",   //------------------
            "Респ. Конго": "Rep. Congo",   //------------------
            "Реюньон": "Reunion",   //------------------
            "Руанда": "Rwanda",
            "Сан-Томе и Принсипи": "Sao Tome and Principe",   //------------------
            "Свазиленд": "Swaziland",   //------------------
            "Сейшельские Острова": "Seychelles",
            "Сенегал": "Senegal",   //------------------
            "Сомали": "Somalia",
            "Судан": "Sudan",
            "Сьерра-Леоне": "Sierra Leone",
            "Танзания": "Tanzania",
            "Того": "Togo",   //------------------
            "Тунис": "Tunisia",
            "Уганда": "Uganda",
            "ЦАР": "CAR",   //------------------
            "Чад": "Chad",   //------------------
            "Экваториальная Гвинея": "Equatorial Guinea",   //------------------
            "Эритрея": "Eritrea",
            "Эфиопия": "Ethiopia",
            "ЮАР": "South Africa",
            "Южный Судан": "South Sudan",   //------------------
    
            // MARK: - БЛИЖНИЙ ВОСТОК
            "Азербайджан": "Azerbaijan",
            "Армения": "Armenia",
            "Бахрейн": "Bahrain",
            "Грузия": "Georgia",
            "Израиль": "Israel",
            "Иордания": "Jordan",
            "Ирак": "Iraq",
            "Иран": "Iran",
            "Йемен": "Yemen",
            "Катар": "Qatar",
            "Кувейт": "Kuwait",
            "Ливан": "Lebanon",
            "Арабские Эмираты": "UAE",
            "Оман": "Oman",
            "Саудовская Аравия": "Saudi Arabia",
            "Сирия": "Syria",
            "Турция": "Turkey",
    
            // MARK: - ЕВРОПА
            "Евросоюз": "European Union",
            "Австрия": "Austria",   //------------------
            "Албания": "Albania",
            "Андорра": "Andorra",   //------------------
            "Беларусь": "Belarus",
            "Бельгия": "Belgium",   //------------------
            "Болгария": "Bulgaria",
            "Босния и Герцеговина": "Bosnia & Herzegovina",
            "Ватикан": "Vatican",   //------------------
            "Великобритания": "United Kingdom",
            "Венгрия": "Hungary",
            "Германия": "Germany",   //------------------
            "Гибралтар": "Gibraltar",
            "Греция": "Greece",   //------------------
            "Дания": "Denmark",
            "Ирландия": "Ireland", //------------------
            "Исландия": "Iceland", //------------------
            "Испания": "Spain", //------------------
            "Италия": "Italy", //------------------
            "Кипр": "Cyprus", //------------------
            "Косово": "Kosovo", //------------------
            "Латвия": "Latvia",
            "Литва": "Lithuania",
            "Лихтенштейн": "Liechtenstein", //------------------
            "Люксембург": "Luxembourg", //------------------
            "Македония": "Macedonia",
            "Мальта": "Malta", //------------------
            "Молдова": "Moldova",
            "Монако": "Monaco", //------------------
            "Нидерланды": "Netherlands", //------------------
            "Норвегия": "Norway",
            "Остров Мэн": "Isle of Man",
            "Польша": "Poland",
            "Португалия": "Portugal", //------------------
            "Румыния": "Romania",
            "Сан-Марино": "San Marino", //------------------
            "Сербия": "Serbia",
            "Словакия": "Slovakia", //------------------
            "Словения": "Slovenia", //------------------
            "Украина": "Ukraine",
            "Фарерские Острова": "Faroe islands", //------------------
            "Финляндия": "Finland", //------------------
            "Франция": "France", //------------------
            "Хорватия": "Croatia",
            "Черногория": "Montenegro", //------------------
            "Чехия": "Czech Republic",
            "Швейцария": "Switzerland",
            "Швеция": "Sweden",
            "Эстония": "Estonia",  //------------------
            "Гернси": "Guernsey",
    
            // MARK: - КАРИБСКИЙ БАССЕЙН
            "Ангилья": "", //------------------
            "Антигуа и Барбуда": "", //------------------
            "Аруба": "Aruba",
            "Багамские Острова": "Bahamas",
            "Барбадос": "Barbados",
            "Британские Виргинские Острова": "", //------------------
            "Виргинские Острова": "", //------------------
            "Гаити": "Haiti",
            "Гваделупа": "", //------------------
            "Гренада": "", //------------------
            "Доминика": "DM",
            
            
            
            
            
            "Доминиканская Республика": "DO",
            "Каймановы острова": "KY",
            "Куба": "CU",
            "Кюрасао": "CW",
            "Мартиника": "MQ",
            "Монтсеррат": "MS",
            "Пуэрто-Рико": "PR",
            "Сент-Винсент и Гренадины": "VC",
            "Сент-Китс и Невис": "KN",
            "Сент-Люсия": "LC",
            "Синт-Мартен": "SX",
            "Тринидад и Тобаго": "TT",
            "Ямайка": "JM",
    
            // MARK: - ОКЕАНИЯ
            "Австралия": "AU",
            "Американское Самоа": "AS",
            "Вануату": "VU",
            "Гуам": "GU",
            "Кирибати": "KI",
            "Кокосовые острова": "CC",
            "Маршалловы Острова": "MH",
            "Микронезия": "FM",
            "Науру": "NR",
            "Ниуэ": "NU",
            "Новая Зеландия": "NZ",
            "Новая Каледония": "NC",
            "Остров Норфолк": "NF",
            "Остров Рождества": "CX",
            "Острова Кука": "CK",
            "Палау": "PW",
            "Самоа": "WS",
            "Северные Марианские острова": "MP",
            "Токелау": "TK",
            "Тонга": "TO",
            "Тувалу": "TV",
            "Уоллис и Футуна": "WF",
            "Фиджи": "FJ",
            "Французская Полинезия": "PF",
            "Соломоновы острова": "SB",
    
            // MARK: - СЕВЕРНАЯ АМЕРИКА
            "Бермудские Острова": "BM",
            "Гренландия": "GL",
            "Канада": "CA",
            "Мексика": "MX",
            "Соединенные Штаты": "US",
    
            // MARK: - ЦЕНТРАЛЬНАЯ АМЕРИКА
            "Белиз": "BZ",
            "Гватемала": "GT",
            "Гондурас": "HN",
            "Коста-Рика": "CR",
            "Никарагуа": "NI",
            "Панама": "PA",
            "Сальвадор": "SV",
    
            // MARK: - ЮЖНАЯ АМЕРИКА
            "Аргентина": "AR",
            "Боливия": "BO",
            "Бразилия": "BR",
            "Венесуэла": "VE",
            "Гайана": "GY",
            "Колумбия": "CO",
            "Парагвай": "PY",
            "Перу": "PE",
            "Суринам": "SR",
            "Уругвай": "UY",
            "Фолклендские острова": "FK",
            "Французская Гвиана": "GF",
            "Чили": "CL",
        ]
    
    
    
    
    let flagsAсndCourties = [
        
        "Австрия": "AT",
        "Азербайджан": "AZ",
        "Албания": "AL",
        "Алжир": "DZ",
        "Ангилья": "AI",
        "Ангола": "AO",
        "Андорра": "AD",
        "Антарктика": "AQ",
        "Антигуа и Барбуда": "AG",
        "Армения": "AM",
        "Аруба": "AW",
        "Афганистан": "AF",
        
        "Багамские Острова": "BS",
        "Бангладеш": "BD",
        "Барбадос": "BB",
        "Бахрейн": "BH",
        "Беларусь": "BY",
        "Бельгия": "BE",
        "Бенин": "BJ",
        "Болгария": "BG",
        "Босния и Герцеговина": "BA",
        "Ботсвана": "BW",
        "Британская территория в Индийском океане": "IO",
        "Британские Виргинские острова": "VG",
        "Бруней": "BN",
        "Буркина-Фасо": "BF",
        "Бурунди": "BI",
        "Бутан": "BT",
        
        "Ватикан": "VA",
        "Великобритания": "GB",
        "Венгрия": "HU",
        "Виргинские острова (США)": "VI",
        "Вьетнам": "VN",
        
        "Габон": "GA",
        "Гаити": "HT",
        "Гамбия": "GM",
        "Гана": "GH",
        "Гваделупа": "GP",
        "Гвинея": "GN",
        "Гвинея-Бисау": "GW",
        "Германия": "DE",
        "Гибралтар": "GI",
        "Гонконг": "HK",
        "Гренада": "GD",
        "Греция": "GR",
        "Грузия": "GE",
        
        "Дания": "DK",
        "Джерси": "JE",
        "Джибути": "DJ",
        
        "Египет": "EG",

        "Замбия": "ZM",
        "Западная Сахара": "EH",
        "Зимбабве": "ZW",
  
        "Израиль": "IL",
        "Индия": "IN",
        "Индонезия": "ID",
        "Иордания": "JO",
        "Ирак": "IQ",
        "Иран": "IR",
        "Ирландия": "IE",
        "Исландия": "IS",
        "Испания": "ES",
        "Италия": "IT",
   
        "Йемен": "YE",
        
        "Казахстан": "KZ",
        "Камбоджа": "KH",
        "Камерун": "CM",
        "Канарские острова": "IC",
        "Катар": "QA",
        "Кения": "KE",
        "Кипр": "CY",
        "Киргизия": "KG",
        "Китай": "CN",
        "Коморы": "KM",
        "Конго": "CG",
        "Конго (Демократическая Республика)": "CD",
        "Кот-д’Ивуар": "CI",
        "Кувейт": "KW",
       
        "Лаос": "LA",
        "Латвия": "LV",
        "Лесото": "LS",
        "Либерия": "LR",
        "Ливан": "LB",
        "Ливия": "LY",
        "Литва": "LT",
        "Лихтенштейн": "LI",
        "Люксембург": "LU",
        
        "Маврикий": "MU",
        "Мавритания": "MR",
        "Мадагаскар": "MG",
        "Майотта": "YT",
        "Макао": "MO",
        "Македония": "MK",
        "Малави": "MW",
        "Малайзия": "MY",
        "Мали": "ML",
        "Мальдивы": "MV",
        "Мальта": "MT",
        "Марокко": "MA",
        
        "Мозамбик": "MZ",
        "Молдова": "MD",
        "Монако": "MC",
        "Монголия": "MN",
        
        "Мьянма (Бирма)": "MM",
        
        "Намибия": "NA",
        "Непал": "NP",
        "Нигер": "NE",
        "Нигерия": "NG",
        "Нидерландские Антильские острова": "AN",
        "Нидерланды": "NL",
        "Норвегия": "NO",
        
        "Объединенные Арабские Эмираты": "AE",
        "Оман": "OM",
        "Остров Буве": "BV",
        "Остров Мэн": "IM",
        "Остров Святой Елены": "SH",
        "Острова Теркс и Кайкос": "TC",
        
        "Пакистан": "PK",
        "Палестина": "PS",
        "Папуа – Новая Гвинея": "PG",
        "Питкерн": "PN",
        "Польша": "PL",
        "Португалия": "PT",
        
        "Республика Корея": "KR",
        "Реюньон": "RE",
        "Россия": "RU",
        "Руанда": "RW",
        "Румыния": "RO",
        
        "Сан-Марино": "SM",
        "Сан-Томе и Принсипи": "ST",
        "Саудовская Аравия": "SA",
        "Свазиленд": "SZ",
        "Сейшелы": "SC",
        "Сен-Бартелеми": "BL",
        "Сен-Мартен": "MF",
        "Сенегал": "SN",
        "Сербия": "RS",
        "Сингапур": "SG",
        "Сирия": "SY",
        "Словакия": "SK",
        "Словения": "SI",
        "Соединенное Королевство": "GB",
        "Сомали": "SO",
        "Судан": "SD",
        "Сьерра-Леоне": "SL",
        
        "Таджикистан": "TJ",
        "Таиланд": "TH",
        "Тайвань": "TW",
        "Танзания": "TZ",
        "Территория Британского Индийского океана": "IO",
        "Территория Джонстона": "UM",
        "Территория Острова Рождества": "CX",
        "Территория острова Херд и острова Макдональд": "HM",
        "Тимор-Лесте (Восточный Тимор)": "TL",
        "Того": "TG",
        "Тунис": "TN",
        "Туркменистан": "TM",
        "Турция": "TR",
        
        "Уганда": "UG",
        "Узбекистан": "UZ",
        "Украина": "UA",
        
        "Фарерские острова": "FO",
        "Филиппины": "PH",
        "Финляндия": "FI",
        "Франция": "FR",
        "Французские Южные и Антарктические Территории": "TF",
        
        "Хорватия": "HR",
        
        "Центрально-Африканская Республика": "CF",
        
        "Чад": "TD",
        "Черногория": "ME",
        "Чехия": "CZ",
        
        "Швейцария": "CH",
        "Швеция": "SE",
        "Шпицберген и Ян-Майен": "SJ",
        "Шри-Ланка": "LK",
        
        "Эквадор": "EC",
        "Экваториальная Гвинея": "GQ",
        "Эритрея": "ER",
        "Эстония": "EE",
        "Эфиопия": "ET",
        
        "Южная Африка": "ZA",
        "Южная Джорджия и Южные Сандвичевы острова": "GS",
        "Южная Осетия": "OS",
        "Южный Судан": "SS",
        
        "Япония": "JP"
    ]
}
