//
//  FlagDataStore.swift
//  Hangman Classic
//
//  Created by M I C H A E L on 25.04.2023.
//

class FlagDataStore {
    
    let flagsAndCourties = [
        // MARK: - АЗИЯ
        "Афганистан": "Afghanistan",
        "Бангладеш": "Bangladesh",
        "Бруней": "Brunei",
        "Бутан": "Bhutan",
        "Восточный Тимор": "Timor-Leste", //--
        "Вьетнам": "Vietnam",
        "Индия": "India",
        "Индонезия": "Indonesia",
        "Казахстан": "Kazakhstan",
        "Камбоджа": "Cambodia",
        "Киргизия": "Kyrgyzstan",
        "Китай": "China",
        "Лаос": "Laos",
        "Макао": "Macau",
        "Малайзия": "Malaysia",
        "Мальдивы": "Maldives",
        "Монголия": "Mongolia",
        "Мьянма": "Myanmar (Burma)",
        "Непал": "Nepal",
        "Пакистан": "Pakistan",
        "Папуа - Новая Гвинея": "Papua New Guinea",
        "Россия": "Russia",
        "Северная Корея": "Korea (North)",
        "Сингапур": "Singapore",
        "Таджикистан": "Tajikistan",
        "Тайланд": "Thailand",
        "Тайвань": "Taiwan",
        "Туркменистан": "Turkmenistan",
        "Узбекистан": "Uzbekistan",
        "Филиппины": "Philippines",
        "Шри-Ланка": "Sri Lanka",
        "Южная Корея": "Korea (South)",
        "Япония": "Japan",
        
        // MARK: - АФРИКА
        "Алжир": "Algeria",
        "Ангола": "Angola",
        "Бенин": "Benin",     //--
        "Ботсвана": "Botswana",
        "Буркина-Фасо": "Burkina Faso",   //--
        "Бурунди": "Burundi",
        "Габон": "Gabon",   //--
        "Гамбия": "Gambia",
        "Гана": "Ghana",
        "Гвинея": "Guinea",
        "Гвинея-Бисау": "Guine-Bissau",   //--
        "Дем. Респ. Конго": "Dem. Rep. Congo",
        "Джибути": "Djibouti",
        "Египет": "Egypt",
        "Эсватини": "Eswatini",
        "Замбия": "Zambia",
        "Западная Сахара": "West Sahara",   //--
        "Зимбабве": "Zimbabwe",   //--
        "Кабо-Верде": "Cabo Verde Escudo",
        "Камерун": "Cameroon",   //--
        "Кения": "Kenya",
        "Коморы": "Comoros",
        "Кот-д'Ивуар": "Ivory Coast",   //--
        "Лесото": "Lesotho",
        "Либерия": "Liberia",
        "Ливия": "Libya",
        "Маврикий": "Mauritius",
        "Мавритания": "Mauritania",
        "Мадагаскар": "Madagascar",
        "Майотта": "Mayotte",   //--
        "Малави": "Malawi",
        
        
        
        "Мали": "Mali",   //------------------
        "Марокко": "Morocco",
        "Мозамбик": "Mozambique",
        "Намибия": "Namibia",
        "Нигер": "Niger",   //------------------
        "Нигерия": "Nigeria",
        "Тристан-да-Кунья": "Tristan da Cunha",   //------------------
        "Респ. Конго": "Rep. Congo",   //------------------
        "Реюньон": "Reunion",   //------------------
        "Руанда": "Rwanda",
        "Сан-Томе и Принсипи": "Sao Tome and Principe",   //------------------
        "Свазиленд": "Swaziland",   //------------------
        "Сейшельские Острова": "Seychelles",
        "Сенегал": "Senegal",   //------------------
        "Сомали": "Somalia",
        "Судан": "Sudan",
        "Сьерра-Леоне": "Sierra Leone",
        "Танзания": "Tanzania",
        "Того": "Togo",   //------------------
        "Тунис": "Tunisia",
        "Уганда": "Uganda",
        "ЦАР": "CAR",   //------------------
        "Чад": "Chad",   //------------------
        "Экваториальная Гвинея": "Equatorial Guinea",   //------------------
        "Эритрея": "Eritrea",
        "Эфиопия": "Ethiopia",
        "ЮАР": "South Africa",
        "Южный Судан": "South Sudan",   //------------------
        
        // MARK: - БЛИЖНИЙ ВОСТОК
        "Азербайджан": "Azerbaijan",
        "Армения": "Armenia",
        "Бахрейн": "Bahrain",
        "Грузия": "Georgia",
        "Израиль": "Israel",
        "Иордания": "Jordan",
        "Ирак": "Iraq",
        "Иран": "Iran",
        "Йемен": "Yemen",
        "Катар": "Qatar",
        "Кувейт": "Kuwait",
        "Ливан": "Lebanon",
        "Арабские Эмираты": "UAE",
        "Оман": "Oman",
        "Саудовская Аравия": "Saudi Arabia",
        "Сирия": "Syria",
        "Турция": "Turkey",
        
        // MARK: - ЕВРОПА
        "Евросоюз": "European Union",
        "Австрия": "Austria",   //------------------
        "Албания": "Albania",
        "Андорра": "Andorra",   //------------------
        "Беларусь": "Belarus",
        "Бельгия": "Belgium",   //------------------
        "Болгария": "Bulgaria",
        "Босния и Герцеговина": "Bosnia & Herzegovina",
        "Ватикан": "Vatican",   //------------------
        "Великобритания": "United Kingdom",
        "Венгрия": "Hungary",
        "Германия": "Germany",   //------------------
        "Гибралтар": "Gibraltar",
        "Греция": "Greece",   //------------------
        "Дания": "Denmark",
        "Ирландия": "Ireland", //------------------
        "Исландия": "Iceland", //------------------
        "Испания": "Spain", //------------------
        "Италия": "Italy", //------------------
        "Кипр": "Cyprus", //------------------
        "Косово": "Kosovo", //------------------
        "Латвия": "Latvia",
        "Литва": "Lithuania",
        "Лихтенштейн": "Liechtenstein", //------------------
        "Люксембург": "Luxembourg", //------------------
        "Македония": "Macedonia",
        "Мальта": "Malta", //------------------
        "Молдова": "Moldova",
        "Монако": "Monaco", //------------------
        "Нидерланды": "Netherlands", //------------------
        "Норвегия": "Norway",
        "Остров Мэн": "Isle of Man",
        "Польша": "Poland",
        "Португалия": "Portugal", //------------------
        "Румыния": "Romania",
        "Сан-Марино": "San Marino", //------------------
        "Сербия": "Serbia",
        "Словакия": "Slovakia", //------------------
        "Словения": "Slovenia", //------------------
        "Украина": "Ukraine",
        "Фарерские Острова": "Faroe islands", //------------------
        "Финляндия": "Finland", //------------------
        "Франция": "France", //------------------
        "Хорватия": "Croatia",
        "Черногория": "Montenegro", //------------------
        "Чехия": "Czech Republic",
        "Швейцария": "Switzerland",
        "Швеция": "Sweden",
        "Эстония": "Estonia",  //------------------
        "Гернси": "Guernsey",
        
        
        
        
        
        
        
        
        
        // MARK: - КАРИБСКИЙ БАССЕЙН
        "Ангилья": "", //------------------
        "Антигуа и Барбуда": "", //------------------
        "Аруба": "Aruba",
        "Багамские Острова": "Bahamas",
        "Барбадос": "Barbados",
        "Британские Виргинские Острова": "", //------------------
        "Виргинские Острова": "", //------------------
        "Гаити": "Haiti",
        "Гваделупа": "", //------------------
        "Гренада": "", //------------------
        "Доминика": "", //------------------
        "Доминиканская Республика": "Dominican Republic",
        "Каймановы Острова": "Cayman Islands",
        "Куба": "Cuba",
        "Кюрасао": "Curacao",
        "Мартиника": "", //------------------
        "Монтсератт": "", //------------------
        "Пуэрто-Рико": "", //------------------
        "Сент-Винсент": "", //------------------
        "Сент-Китс и Невис": "", //------------------
        "Сент-Люсия": "", //------------------
        "Синт-Мартен": "", //------------------
        "Теркс и Кайкос": "", //------------------
        "Тринидад и Тобаго": "Trinidad & Tobago",
        "Ямайка": "Jamaica",
        
        // MARK: - ОКЕАНИЯ
        "Австралия": "Australia",
        "Американское Самоа": "", //------------------
        "Вануату": "Vanuatu",
        "Гуам": "", //------------------
        "Кирибати": "", //------------------
        "Кокосовые Острова": "", //------------------
        "Маршалловы Острова": "", //------------------
        "Микронезия": "", //------------------
        "Науру": "", //------------------
        "Ниуэ": "", //------------------
        "Новая Зеландия": "New Zealand",
        "Новая Каледония": "", //------------------
        "Остров Норфолк": "", //------------------
        "Остров Рождества": "", //------------------
        "Острова Ашмор и Картье": "", //------------------
        "Острова Кука": "", //------------------
        "Остров Питкэрн": "", //------------------
        
        "Палау": "", //------------------
        "Самоа": "Samoa",
        "Северные Марианские острова": "", //------------------
        "Токелау": "", //------------------
        "Тонга": "Tonga",
        "Тувалу": "", //------------------
        "Уоллис и Футуна": "", //------------------
        "Фиджи": "Fiji",
        "Французская Полинезия": "", //------------------
        "Соломоновы Острова": "Solomon Islands",
        
        // MARK: - СЕВЕРНАЯ АМЕРИКА
        "Бермудские Острова": "Bermuda",
        "Гренландия": "", //------------------
        "Канада": "Canada",
        "Мексика": "Mexico",
        "США": "United States",
        
        // MARK: - ЦЕНТРАЛЬНАЯ АМЕРИКА
        "Белиз": "Belize",
        "Гватемала": "Guatemala",
        "Гондурас": "Honduras",
        "Коста-Рика": "Costa Rica",
        "Никарагуа": "Nicaragua",
        "Панама": "Panama",
        "Эль-Сальвадор": "El Salvador",
        
        // MARK: - ЮЖНАЯ АМЕРИКА
        "Аргентина": "Argentina",
        "Боливия": "Bolivia",
        "Бразилия": "Brazil",
        "Венесуэла": "Venezuela",
        "Гайана": "Guyana",
        "Колумбия": "Colombia",
        "Парагвай": "Paraguay",
        "Перу": "Peru",
        "Суринам": "Suriname",
        "Уругвай": "Uruguay",
        "Фолклендские Острова": "Falkland Islands",
        "Французская Гвиана": "", //------------------
        "Чили": "Chile",
    ]
}
